## Plan for terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
file_scanning.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 11 to add, 5 to change, 14 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                          NAME                                          |
|----------|----------------------------------------------------------------------------------------|
| delete   | `module.s3_scan_objects.aws_cloudwatch_log_group.s3_scan_object`                       |
|          | `module.s3_scan_objects.aws_iam_policy.s3_scan_object`                                 |
|          | `module.s3_scan_objects.aws_iam_role.s3_scan_object`                                   |
|          | `module.s3_scan_objects.aws_iam_role_policy_attachment.s3_scan_object`                 |
|          | `module.s3_scan_objects.aws_lambda_function.s3_scan_object`                            |
|          | `module.s3_scan_objects.aws_lambda_permission.s3_execute`                              |
|          | `module.s3_scan_objects_dev.aws_cloudwatch_log_group.s3_scan_object`                   |
|          | `module.s3_scan_objects_dev.aws_iam_policy.s3_scan_object`                             |
|          | `module.s3_scan_objects_dev.aws_iam_role.s3_scan_object`                               |
|          | `module.s3_scan_objects_dev.aws_iam_role_policy_attachment.s3_scan_object`             |
|          | `module.s3_scan_objects_dev.aws_lambda_function.s3_scan_object`                        |
|          | `module.s3_scan_objects_dev.aws_lambda_permission.s3_execute`                          |
| update   | `aws_lambda_alias.share_files_securely`                                                |
|          | `module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object`                     |
|          | `module.s3_scan_objects_dev.aws_s3_bucket_notification.s3_scan_object`                 |
|          | `module.share_files_securely_bucket.aws_s3_bucket.this`                                |
|          | `module.share_files_securely_bucket_dev.aws_s3_bucket.this`                            |
| recreate | `module.vpc.aws_network_acl_rule.block_rdp[0]`                                         |
|          | `module.vpc.aws_network_acl_rule.block_ssh[0]`                                         |
| add      | `module.s3_scan_objects.aws_kms_alias.s3_scan_object_queue`                            |
|          | `module.s3_scan_objects.aws_kms_key.s3_scan_object_queue`                              |
|          | `module.s3_scan_objects.aws_sqs_queue.s3_scan_object`                                  |
|          | `module.s3_scan_objects.aws_sqs_queue_policy.s3_scan_object`                           |
|          | `module.s3_scan_objects_dev.aws_kms_alias.s3_scan_object_queue`                        |
|          | `module.s3_scan_objects_dev.aws_kms_key.s3_scan_object_queue`                          |
|          | `module.s3_scan_objects_dev.aws_sqs_queue.s3_scan_object`                              |
|          | `module.s3_scan_objects_dev.aws_sqs_queue_policy.s3_scan_object`                       |
|          | `module.share_files_securely_lambda.aws_cloudwatch_query_definition.lambda_statistics` |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/share-files-securely/actions/runs/5534502398).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_lambda_alias.share_files_securely will be updated in-place
  ~ resource "aws_lambda_alias" "share_files_securely" {
        id               = "arn:aws:lambda:ca-central-1:283582579564:function:share_files_securely:latest"
        name             = "latest"
        # (5 unchanged attributes hidden)

      - routing_config {
          - additional_version_weights = {
              - "11" = 0
            } -> null
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object"  {
      ~ id      = "1991941360" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely:log-stream:*",
                          - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              - "logs:CreateLogStream",
              - "logs:PutLogEvents",
              + "sqs:SendMessage",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely",
              - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely:log-stream:*",
              ~ (known after apply),
            ]
          + sid           = "S3sendToSQS"
            # (1 unchanged attribute hidden)

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:s3:::share-files-securely",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      ~ statement {
          ~ actions       = [
              - "lambda:InvokeFunction",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object",
              ~ (known after apply),
            ]
          + sid           = "LambdaTriggerFromSQS"
            # (1 unchanged attribute hidden)

          + principals {
              + identifiers = [
                  + "arn:aws:iam::806545929748:role/s3-scan-object",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.s3_scan_objects.aws_cloudwatch_log_group.s3_scan_object will be destroyed
  - resource "aws_cloudwatch_log_group" "s3_scan_object" {
      - arn               = "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely" -> null
      - id                = "/aws/lambda/s3-scan-object-share-files-securely" -> null
      - name              = "/aws/lambda/s3-scan-object-share-files-securely" -> null
      - retention_in_days = 7 -> null
      - tags              = {
          - "CostCentre" = "share-files-securely"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "share-files-securely"
          - "Terraform"  = "true"
        } -> null
    }

  # module.s3_scan_objects.aws_iam_policy.s3_scan_object will be destroyed
  - resource "aws_iam_policy" "s3_scan_object" {
      - arn       = "arn:aws:iam::283582579564:policy/S3ScanObject-share-files-securely" -> null
      - id        = "arn:aws:iam::283582579564:policy/S3ScanObject-share-files-securely" -> null
      - name      = "S3ScanObject-share-files-securely" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely:log-stream:*",
                          - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAUEBWWYNWN7CX4CEZI" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.s3_scan_objects.aws_iam_role.s3_scan_object will be destroyed
  - resource "aws_iam_role" "s3_scan_object" {
      - arn                   = "arn:aws:iam::283582579564:role/S3ScanObject-share-files-securely" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-07-08T13:52:57Z" -> null
      - force_detach_policies = false -> null
      - id                    = "S3ScanObject-share-files-securely" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::283582579564:policy/S3ScanObject-share-files-securely",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "S3ScanObject-share-files-securely" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAUEBWWYNWLVRR6TDJW" -> null

      - inline_policy {}
    }

  # module.s3_scan_objects.aws_iam_role_policy_attachment.s3_scan_object will be destroyed
  - resource "aws_iam_role_policy_attachment" "s3_scan_object" {
      - id         = "S3ScanObject-share-files-securely-20220708135311530500000002" -> null
      - policy_arn = "arn:aws:iam::283582579564:policy/S3ScanObject-share-files-securely" -> null
      - role       = "S3ScanObject-share-files-securely" -> null
    }

  # module.s3_scan_objects.aws_kms_alias.s3_scan_object_queue will be created
  + resource "aws_kms_alias" "s3_scan_object_queue" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3_scan_object_queue"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.s3_scan_objects.aws_kms_key.s3_scan_object_queue will be created
  + resource "aws_kms_key" "s3_scan_object_queue" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "S3 scan objects KMS key for SQS queue encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::283582579564:root"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::806545929748:role/s3-scan-object"
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "share-files-securely"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "share-files-securely"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_objects.aws_lambda_function.s3_scan_object will be destroyed
  - resource "aws_lambda_function" "s3_scan_object" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:283582579564:function:s3-scan-object-share-files-securely" -> null
      - filename                       = "/tmp/main.py.zip" -> null
      - function_name                  = "s3-scan-object-share-files-securely" -> null
      - handler                        = "main.handler" -> null
      - id                             = "s3-scan-object-share-files-securely" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:283582579564:function:s3-scan-object-share-files-securely/invocations" -> null
      - last_modified                  = "2022-07-11T15:33:34.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:283582579564:function:s3-scan-object-share-files-securely:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:283582579564:function:s3-scan-object-share-files-securely:$LATEST/invocations" -> null
      - reserved_concurrent_executions = 3 -> null
      - role                           = "arn:aws:iam::283582579564:role/S3ScanObject-share-files-securely" -> null
      - runtime                        = "python3.8" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "H+LWBR73DEeblAitNF5EPT8Pi5KToRQJ/rlEwevztiY=" -> null
      - source_code_size               = 551 -> null
      - tags                           = {
          - "CostCentre" = "share-files-securely"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "share-files-securely"
          - "Terraform"  = "true"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "ACCOUNT_ID"                  = "283582579564"
              - "S3_SCAN_OBJECT_FUNCTION_ARN" = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.s3_scan_objects.aws_lambda_permission.s3_execute will be destroyed
  - resource "aws_lambda_permission" "s3_execute" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "s3-scan-object-share-files-securely" -> null
      - id            = "S3ScanObjectS3Invoke-share-files-securely" -> null
      - principal     = "s3.amazonaws.com" -> null
      - source_arn    = "arn:aws:s3:::share-files-securely" -> null
      - statement_id  = "S3ScanObjectS3Invoke-share-files-securely" -> null
    }

  # module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object will be updated in-place
  ~ resource "aws_s3_bucket_notification" "s3_scan_object" {
        id          = "share-files-securely"
        # (2 unchanged attributes hidden)

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - id                  = "ScanObjectCreated" -> null
          - lambda_function_arn = "arn:aws:lambda:ca-central-1:283582579564:function:s3-scan-object-share-files-securely" -> null
        }

      + queue {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = "ScanObjectCreated"
          + queue_arn = (known after apply)
        }
    }

  # module.s3_scan_objects.aws_sqs_queue.s3_scan_object will be created
  + resource "aws_sqs_queue" "s3_scan_object" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "s3-scan-object"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCentre" = "share-files-securely"
          + "Terraform"  = "true"
        }
      + tags_all                          = {
          + "CostCentre" = "share-files-securely"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.s3_scan_objects.aws_sqs_queue_policy.s3_scan_object will be created
  + resource "aws_sqs_queue_policy" "s3_scan_object" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.s3_scan_objects_dev.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object"  {
      ~ id      = "3911711235" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely-dev:log-stream:*",
                          - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely-dev",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              - "logs:CreateLogStream",
              - "logs:PutLogEvents",
              + "sqs:SendMessage",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely-dev",
              - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely-dev:log-stream:*",
              ~ (known after apply),
            ]
          + sid           = "S3sendToSQS"
            # (1 unchanged attribute hidden)

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:s3:::share-files-securely-dev",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      ~ statement {
          ~ actions       = [
              - "lambda:InvokeFunction",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object",
              ~ (known after apply),
            ]
          + sid           = "LambdaTriggerFromSQS"
            # (1 unchanged attribute hidden)

          + principals {
              + identifiers = [
                  + "arn:aws:iam::806545929748:role/s3-scan-object",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.s3_scan_objects_dev.aws_cloudwatch_log_group.s3_scan_object will be destroyed
  - resource "aws_cloudwatch_log_group" "s3_scan_object" {
      - arn               = "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely-dev" -> null
      - id                = "/aws/lambda/s3-scan-object-share-files-securely-dev" -> null
      - name              = "/aws/lambda/s3-scan-object-share-files-securely-dev" -> null
      - retention_in_days = 7 -> null
      - tags              = {
          - "CostCentre" = "share-files-securely"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "share-files-securely"
          - "Terraform"  = "true"
        } -> null
    }

  # module.s3_scan_objects_dev.aws_iam_policy.s3_scan_object will be destroyed
  - resource "aws_iam_policy" "s3_scan_object" {
      - arn       = "arn:aws:iam::283582579564:policy/S3ScanObject-share-files-securely-dev" -> null
      - id        = "arn:aws:iam::283582579564:policy/S3ScanObject-share-files-securely-dev" -> null
      - name      = "S3ScanObject-share-files-securely-dev" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely-dev:log-stream:*",
                          - "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/s3-scan-object-share-files-securely-dev",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAUEBWWYNWMWMWNQ72C" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.s3_scan_objects_dev.aws_iam_role.s3_scan_object will be destroyed
  - resource "aws_iam_role" "s3_scan_object" {
      - arn                   = "arn:aws:iam::283582579564:role/S3ScanObject-share-files-securely-dev" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-07-15T13:16:56Z" -> null
      - force_detach_policies = false -> null
      - id                    = "S3ScanObject-share-files-securely-dev" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::283582579564:policy/S3ScanObject-share-files-securely-dev",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "S3ScanObject-share-files-securely-dev" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAUEBWWYNWGUVJF4B2O" -> null

      - inline_policy {}
    }

  # module.s3_scan_objects_dev.aws_iam_role_policy_attachment.s3_scan_object will be destroyed
  - resource "aws_iam_role_policy_attachment" "s3_scan_object" {
      - id         = "S3ScanObject-share-files-securely-dev-20220715131711846300000001" -> null
      - policy_arn = "arn:aws:iam::283582579564:policy/S3ScanObject-share-files-securely-dev" -> null
      - role       = "S3ScanObject-share-files-securely-dev" -> null
    }

  # module.s3_scan_objects_dev.aws_kms_alias.s3_scan_object_queue will be created
  + resource "aws_kms_alias" "s3_scan_object_queue" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3_scan_object_queueDEV"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.s3_scan_objects_dev.aws_kms_key.s3_scan_object_queue will be created
  + resource "aws_kms_key" "s3_scan_object_queue" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "S3 scan objects KMS key for SQS queue encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::283582579564:root"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::806545929748:role/s3-scan-object"
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "share-files-securely"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "share-files-securely"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_objects_dev.aws_lambda_function.s3_scan_object will be destroyed
  - resource "aws_lambda_function" "s3_scan_object" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:283582579564:function:s3-scan-object-share-files-securely-dev" -> null
      - filename                       = "/tmp/main.py.zip" -> null
      - function_name                  = "s3-scan-object-share-files-securely-dev" -> null
      - handler                        = "main.handler" -> null
      - id                             = "s3-scan-object-share-files-securely-dev" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:283582579564:function:s3-scan-object-share-files-securely-dev/invocations" -> null
      - last_modified                  = "2022-07-15T13:17:11.020+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:283582579564:function:s3-scan-object-share-files-securely-dev:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:283582579564:function:s3-scan-object-share-files-securely-dev:$LATEST/invocations" -> null
      - reserved_concurrent_executions = 3 -> null
      - role                           = "arn:aws:iam::283582579564:role/S3ScanObject-share-files-securely-dev" -> null
      - runtime                        = "python3.8" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "H+LWBR73DEeblAitNF5EPT8Pi5KToRQJ/rlEwevztiY=" -> null
      - source_code_size               = 551 -> null
      - tags                           = {
          - "CostCentre" = "share-files-securely"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "share-files-securely"
          - "Terraform"  = "true"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "ACCOUNT_ID"                  = "283582579564"
              - "S3_SCAN_OBJECT_FUNCTION_ARN" = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.s3_scan_objects_dev.aws_lambda_permission.s3_execute will be destroyed
  - resource "aws_lambda_permission" "s3_execute" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "s3-scan-object-share-files-securely-dev" -> null
      - id            = "S3ScanObjectS3Invoke-share-files-securely-dev" -> null
      - principal     = "s3.amazonaws.com" -> null
      - source_arn    = "arn:aws:s3:::share-files-securely-dev" -> null
      - statement_id  = "S3ScanObjectS3Invoke-share-files-securely-dev" -> null
    }

  # module.s3_scan_objects_dev.aws_s3_bucket_notification.s3_scan_object will be updated in-place
  ~ resource "aws_s3_bucket_notification" "s3_scan_object" {
        id          = "share-files-securely-dev"
        # (2 unchanged attributes hidden)

  ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.share_files_securely"]

23 tests, 17 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
